Revit 2024 API
Ceramic.CeramicBump Property
 The property labeled "Type" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string CeramicBump { get; }
Visual Basic
Public Shared ReadOnly Property CeramicBump As String
	Get
Visual C++
public:
static property String^ CeramicBump {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicBumpType".
See Also
Ceramic Class
Autodesk.Revit.DB.Visual Namespace